Tekla Open API Reference for Tekla Structures 2025
ProfileCatalog Class
 The ProfileCatalog class represents a group of controls to select profiles using the profile catalogs.
Inheritance Hierarchy
System.Object
 System.MarshalByRefObject
 System.ComponentModel.Component
 System.Windows.Forms.Control
 System.Windows.Forms.ScrollableControl
 System.Windows.Forms.ContainerControl
 System.Windows.Forms.UserControl
 Tekla.Structures.Dialog.UIControls.ProfileCatalog
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public class ProfileCatalog : UserControl
Public Class ProfileCatalog
	Inherits UserControl
The ProfileCatalog type exposes the following members.
Constructors
Name | Description
ProfileCatalog()
 Initiates a new instance of the control.
ProfileCatalog(String)
 Initiates a new instance of the control selecting the given profile.
Top
Properties
Name | Description
ButtonText
 Gets and sets the text of the button control.
SelectedProfile
 The selected profile in the control.
Top
Methods
Name | Description
OnValueChanged
 Event handler for passing generic catalog data back to dialog
Top
Events
Name | Description
SelectClicked
 The SelectClicked event is raised when the Select button is clicked.
SelectionDone
 The SelectionDone event is raised when the profile selection dialog is closed.
Top
See Also
Reference
Tekla.Structures.Dialog.UIControls Namespace